Repository: shakircam/PubChamApp
Catalog: lib/l10n/app_*.arb
Languages: bn

source: More Settings
bn: আরও সেটিংস

# appearanceAndPreferences
source: APPEARANCE & PREFERENCES
bn: চেহারা এবং পছন্দসমূহ

source: Dark Mode
bn: ডার্ক মোড

source: PREMIUM
bn: প্রিমিয়াম

source: Language
bn: ভাষা

# securityAndAlerts
source: SECURITY & ALERTS
bn: নিরাপত্তা এবং সতর্কতা

source: Notifications
bn: বিজ্ঞপ্তি

# privacyAndData
source: Privacy & Data
bn: গোপনীয়তা এবং ডেটা

source: About PubChem Explorer
bn: PubChem Explorer সম্পর্কে

source: Empowering Chemical Intelligence
bn: রাসায়নিক বুদ্ধিমত্তা ক্ষমতায়ন

# version
source: VERSION 1.0.1
bn: সংস্করণ ১.০.১

source: Select Language
bn: ভাষা নির্বাচন করুন

source: Search for compounds...
bn: যৌগ অনুসন্ধান করুন...

# searchScreenComingSoon
source: Search results will appear here
bn: সার্চ ফলাফল এখানে দেখানো হবে

# searchRecentTitle
source: Recent Searches
bn: সাম্প্রতিক অনুসন্ধান

# searchClearHistory
source: Clear History
bn: ইতিহাস মুছুন

# searchNoRecent
source: No recent searches yet
bn: এখনও কোন সাম্প্রতিক অনুসন্ধান নেই

# searchingLabel
source: Searching...
bn: খোঁজা হচ্ছে...

# searchEmptyTitle
source: No compounds found
bn: কোন যৌগ পাওয়া যায়নি

# searchEmptySubtitle
source: Try a different name.
bn: অন্য নাম দিয়ে চেষ্টা করুন।

# searchErrorTitle
source: Something went wrong
bn: কিছু একটা ভুল হয়েছে

# searchErrorSubtitle
source: Please check your connection and try again.
bn: ইন্টারনেট সংযোগ চেক করে আবার চেষ্টা করুন।

# searchRetry
source: Retry
bn: আবার চেষ্টা করুন

# compoundDetailsTitle
source: Compound Details
bn: যৌগ বিবরণ

# detailsScreenComingSoon
source: Details will appear here soon
bn: বিবরণ শীঘ্রই এখানে দেখানো হবে

source: Trending
bn: ট্রেন্ডিং

source: Favorites
bn: প্রিয়

source: Recent
bn: সাম্প্রতিক

source: Featured Molecules
bn: বৈশিষ্ট্যযুক্ত অণু

# curatedChemicalStructures
source: Curated chemical structures for study
bn: অধ্যয়নের জন্য নির্বাচিত রাসায়নিক কাঠামো

source: Latest Insights
bn: সর্বশেষ অন্তর্দৃষ্টি

source: Molecular Analysis
bn: আণবিক বিশ্লেষণ

# realtimeBindingAffinity
source: Real-time binding affinity predictions
bn: রিয়েল-টাইম বাইন্ডিং অ্যাফিনিটি পূর্বাভাস

source: Lab Integration
bn: ল্যাব ইন্টিগ্রেশন

# syncWithELN
source: Sync with ELN laboratory data
bn: ELN ল্যাবরেটরি ডেটার সাথে সিঙ্ক করুন
